{
  "ir_version": "1.0",

  "config": {
    "table_cols": 3,
    "header_rows": 2,
    "body_rows": 2,
    "stub_cols": 0,
    "row_striping": false,
    "row_striping_include_stub": false,
    "row_striping_include_body": false,
    "column_labels_hidden": false,
    "table_width": null,
    "container_width": null,
    "container_height": null,
    "container_overflow": null,
    "locale": "en-US",
    "page_break_mode": "avoid",
    "aria_label": null,
    "aria_describedby": null,
    "summary": null
  },

  "styles": {
    "defs": {},
    "compositions": {},
    "conditionals": []
  },

  "header": {
    "title": null,
    "subtitle": null,
    "extra_lines": [],
    "preheader_content": null
  },

  "column_spec": [
    { "id": "col_0", "align": "left", "align_char": null, "width": "auto", "min_width": null, "max_width": null, "style_id": null, "hidden": false, "label": "Name" },
    { "id": "col_1", "align": "right", "align_char": null, "width": "auto", "min_width": null, "max_width": null, "style_id": null, "hidden": false, "label": "Q1" },
    { "id": "col_2", "align": "right", "align_char": null, "width": "auto", "min_width": null, "max_width": null, "style_id": null, "hidden": false, "label": "Q2" }
  ],

  "table": {
    "thead": {
      "rows": [
        {
          "role": "spanner_label",
          "style_id": null,
          "cells": [
            {
              "content": [],
              "colspan": 1,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": false,
              "scope": null,
              "sort_key": null,
              "data_type": null
            },
            {
              "content": [{ "type": "text", "value": "Scores" }],
              "colspan": 2,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": false,
              "scope": "colgroup",
              "sort_key": null,
              "data_type": null
            },
            {
              "content": [],
              "colspan": 1,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": true,
              "scope": null,
              "sort_key": null,
              "data_type": null
            }
          ]
        },
        {
          "role": "column_label",
          "style_id": null,
          "cells": [
            {
              "content": [{ "type": "text", "value": "Name" }],
              "colspan": 1,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": false,
              "scope": "col",
              "sort_key": null,
              "data_type": "string"
            },
            {
              "content": [{ "type": "text", "value": "Q1" }],
              "colspan": 1,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": false,
              "scope": "col",
              "sort_key": null,
              "data_type": "number"
            },
            {
              "content": [{ "type": "text", "value": "Q2" }],
              "colspan": 1,
              "rowspan": 1,
              "style_id": null,
              "is_stub": false,
              "is_placeholder": false,
              "scope": "col",
              "sort_key": null,
              "data_type": "number"
            }
          ]
        }
      ]
    },

    "tbody": [
      {
        "group_id": null,
        "label": null,
        "rows": [
          {
            "role": null,
            "style_id": null,
            "cells": [
              {
                "content": [{ "type": "text", "value": "Alice" }],
                "typed_value": { "type": "string", "value": "Alice" },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "string", "sort_key": "alice"
              },
              {
                "content": [{ "type": "text", "value": "90" }],
                "typed_value": { "type": "number", "value": 90 },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "number", "sort_key": 90
              },
              {
                "content": [{ "type": "text", "value": "95" }],
                "typed_value": { "type": "number", "value": 95 },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "number", "sort_key": 95
              }
            ]
          },
          {
            "role": null,
            "style_id": null,
            "cells": [
              {
                "content": [{ "type": "text", "value": "Bob" }],
                "typed_value": { "type": "string", "value": "Bob" },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "string", "sort_key": "bob"
              },
              {
                "content": [{ "type": "text", "value": "85" }],
                "typed_value": { "type": "number", "value": 85 },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "number", "sort_key": 85
              },
              {
                "content": [{ "type": "text", "value": "88" }],
                "typed_value": { "type": "number", "value": 88 },
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": "number", "sort_key": 88
              }
            ]
          }
        ],
        "summary_rows": []
      }
    ]
  },

  "footer": { "footnotes": [], "source_notes": [] },
  "extensions": {}
}
