{
  "ir_version": "1.0",

  "config": {
    "table_cols": 2,
    "header_rows": 1,
    "body_rows": 2,
    "stub_cols": 0,
    "row_striping": false,
    "row_striping_include_stub": false,
    "row_striping_include_body": false,
    "column_labels_hidden": false,
    "table_width": null,
    "container_width": null,
    "container_height": null,
    "container_overflow": null,
    "locale": "en-US",
    "page_break_mode": "avoid",
    "aria_label": null,
    "aria_describedby": null,
    "summary": null
  },

  "styles": {
    "defs": {},
    "compositions": {},
    "conditionals": []
  },

  "header": {
    "title": null,
    "subtitle": null,
    "extra_lines": [],
    "preheader_content": null
  },

  "column_spec": [
    { "id": "col_0", "align": "left", "align_char": null, "width": "auto", "min_width": null, "max_width": null, "style_id": null, "hidden": false, "label": "Label" },
    { "id": "col_1", "align": "left", "align_char": null, "width": "auto", "min_width": null, "max_width": null, "style_id": null, "hidden": false, "label": "Content" }
  ],

  "table": {
    "thead": {
      "rows": [
        {
          "role": "column_label",
          "style_id": null,
          "cells": [
            { "content": [{ "type": "text", "value": "Label" }], "colspan": 1, "rowspan": 1, "style_id": null, "is_stub": false, "is_placeholder": false, "scope": "col", "sort_key": null, "data_type": null },
            { "content": [{ "type": "text", "value": "Content" }], "colspan": 1, "rowspan": 1, "style_id": null, "is_stub": false, "is_placeholder": false, "scope": "col", "sort_key": null, "data_type": null }
          ]
        }
      ]
    },

    "tbody": [
      {
        "group_id": null,
        "label": null,
        "rows": [
          {
            "role": null, "style_id": null,
            "cells": [
              {
                "content": [{ "type": "text", "value": "Rich content" }],
                "typed_value": null,
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": null, "sort_key": null
              },
              {
                "content": [
                  { "type": "text", "value": "Normal text, " },
                  { "type": "styled_text", "value": "bold text", "style_id": null },
                  { "type": "line_break" },
                  { "type": "text", "value": "second line with " },
                  { "type": "footnote_mark", "ref": "fn1", "mark_text": "*" }
                ],
                "typed_value": null,
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": null, "sort_key": null
              }
            ]
          },
          {
            "role": null, "style_id": null,
            "cells": [
              {
                "content": [{ "type": "text", "value": "Image cell" }],
                "typed_value": null,
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": null, "sort_key": null
              },
              {
                "content": [
                  { "type": "text", "value": "Trend: " },
                  { "type": "image", "src": "data:image/png;base64,iVBORw0KGgoAAAANSUhEUg==", "alt": "sparkline", "width": "60px", "height": "16px" }
                ],
                "typed_value": null,
                "colspan": 1, "rowspan": 1, "style_id": null,
                "is_stub": false, "is_placeholder": false,
                "data_type": null, "sort_key": null
              }
            ]
          }
        ],
        "summary_rows": []
      }
    ]
  },

  "footer": {
    "footnotes": [
      {
        "id": "fn1",
        "mark": "*",
        "content": [{ "type": "text", "value": "Estimated value." }],
        "style_id": null
      }
    ],
    "source_notes": []
  },

  "extensions": {}
}
